DELETE FROM clients;
INSERT INTO clients
    (full_name, birthday, gender, add_date)
VALUES
    ('Иванов Иван Петрович', '1991-04-12', 'м', '2015-12-24 23:24:24'),
    ('Салазанова Ирина Иванова', '1980-04-12', 'ж', '2015-12-24 23:24:24'),
    ('Халиуллина Гузель Фоатовна', '1995-08-12', 'ж', '2015-07-11 23:24:24'),
    ('Александрова Дарья Петрова', '1995-09-12', 'ж', '2015-07-22 23:24:24'),
    ('Низамиев Нияз Булатович', '1969-04-09', 'м', '2014-12-24 23:24:24'),
    ('Петрушкин Петр Данилович', '1970-04-11', 'м', '2013-12-10 12:12:12'),
    ('Козлов Тимур Владимирович', '1995-04-01', 'м', '2015-12-10 23:24:24');
DELETE FROM messages;
INSERT INTO messages
    (title, message, add_date)
VALUES
    ('Примите участие в акции!', 'Текст который ну не хочется придумывать, суть ясна, хотя для поиска напишу акция', '2015-09-03 14:30:01'),
    ('Спасибо за то что вы с нами!', 'По вопросам звоните 8-800-888-88-88', '2015-07-22 23:24:24'),
    ('Акция', 'Текст который ну не хочется придумывать, суть ясна, хотя для поиска напишу акция', '2015-06-06 11:11:11');

DELETE FROM abonements;
INSERT INTO abonements
    (balance, client_id, add_date)
VALUES
    ('300', 106, NOW()),
    ('150', 106, NOW()),
    ('365', 108, NOW()),
    ('3000', 109, NOW()),
    ('2000', 110, NOW()),
    ('3000', 111, NOW()),
    ('1000', 112, NOW()),
    ('50', 109, NOW()),
    ('20', 109, NOW());
    
DELETE FROM clientMessage;
INSERT INTO clientMessage
    (reading, client_id, message_id)
VALUES
    (true, 107, 46),
    (true, 108, 46),
    (true, 109, 46),
    (true, 110, 46),
    (true, 111, 46),
    (true, 107, 47),
    (true, 108, 47),
    (true, 109, 47),
    (true, 110, 47),
    (true, 111, 47),
    (true, 106, 48),
    (false, 112, 46),
    (false, 112, 48),
    (true, 112, 47);
    
DELETE FROM visits;
INSERT INTO visits
    (visit_from, visit_to, abonement_id)
VALUES
    ('2015-12-11 12:40:13', '2015-12-11 13:40:00', 24),
    ('2015-12-10 12:35:55', '2015-12-10 13:55:00', 25),
    ('2015-12-10 12:35:33', '2015-12-10 13:55:12', 26),
    ('2015-12-11 12:35:33', '2015-12-11 13:55:33', 26),
    ('2015-12-12 12:45:33', '2015-12-12 14:55:55', 27),
    ('2015-12-12 12:35:33', '2015-12-12 13:55:01', 24);
    
DELETE FROM trainers;
INSERT INTO trainers
    (full_name, price)
VALUES
    ('Галеев Дамир Ильхамович', '1500'),
    ('Давлетшина Диляра Таймуразовна', '2000'),
    ('Лотфуллин Ирек Искандерович', '1000');

DELETE FROM trainers_table;
INSERT INTO trainers_table
    (day, time_from, time_to, trainer_id)
VALUES
    ('ПН', '13:00', '20:00', 1),
    ('ВТ', '16:00', '20:00', 1),
    ('СР', '18:00', '20:00', 1),
    ('ЧТ', '09:00', '18:00', 1),
    ('ПТ', '08:00', '15:00', 1),
    ('ПН', '09:00', '17:00', 2),
    ('СР', '10:00', '18:00', 2),
    ('ПТ', '11:00', '20:00', 2),
    ('ПН', '08:00', '20:00', 3),
    ('ЧТ', '08:00', '20:00', 3);