INSERT INTO cities (name)
VALUES
  ('Казань'),
  ('Москва'),
  ('Санкт-Петербург'),
  ('Калининград'),
  ('Нефтекамск');

INSERT INTO airports (iata_code, city_id)
VALUES
  ('KZN', 1),
  ('SVO', 2),
  ('DME', 2),
  ('VKO', 2),
  ('LED', 3),
  ('NEF', 5);

INSERT INTO plane_manufacturers (name)
VALUES
  ('Аэробус'),
  ('Боинг'),
  ('Локхид'),
  ('Сухой'),
  ('Ту'),
  ('Як'),
  ('Ан'),
  ('Ил');

INSERT INTO planes (manufacturer_id, model, seat_count, board_number)
VALUES
  (1, 'А-320', 150, 'AZX-3#51'),
  (1, 'А-350', 350, '1234567'),
  (1, 'А-380', 555, 'xDyp77719'),
  (2, '777', 479, 'TeEsT1&2@$'),
  (2, '787 Dreamliner', 250, 'ks8(){}[]'),
  (3, 'L-1011 TriStar 500', 330, '99|\/*-+.-------------------'),
  (4, 'Суперджет 100', 95, '!@#$%^&*122'),
  (5, 'Ту-144', 150, 'qwerty'),
  (7, 'Ан-124 Руслан', 88, 'ytrewq'),
  (7, 'Ан-225 Мрия', 4, '12345');

INSERT INTO persons (name, birthday)
VALUES
  ('tp', '1995-08-19'),
  ('Пеле', '1950-12-31');

INSERT INTO persons (name, surname, birthday)
VALUES
  ('Алмаз', 'Габделхадиев', '1997-01-18'),
  ('Александр', 'Исаев', '1994-11-15'),
  ('Человек', 'Человеков', '2015-10-20'),
  ('Кристина', 'Ковальчук', '1980-06-08'),
  ('Евгений', 'Гриневич', '1985-09-05'),
  ('Элина', 'Камирен', '1991-01-06'),
  ('Алексей', 'Гаврилов', '1983-08-06'),
  ('Евгений', 'Евтухов', '1968-06-28'),
  ('Валерий', 'Кипелов', '1958-07-12'),
  ('Диана', 'Макиева', '1989-12-31'),
  ('Анатолий', 'Локоть', '1953-01-18'),
  ('Ксения', 'Чумичева', '1947-03-25'),
  ('Святослав', 'Степанов', '1976-05-30'),
  ('Илона', 'Новосёлова', '1985-11-02'),
  ('Оксана', 'Почепа', '1984-07-20'),
  ('Артём', 'Угляров', '1990-12-23'),
  ('Илья', 'Колесников', '1978-04-12'),
  ('Глеб', 'Калюжный', '1969-08-14'),
  ('Юлия', 'Паршута', '1988-04-23');

INSERT INTO employees (person_id)
VALUES
  (2),
  (4),
  (7),
  (13),
  (14),
  (18),
  (20),
  (21);

INSERT INTO flight_crews (pilot_id)
VALUES
  (1),
  (3),
  (7);

INSERT INTO flight_crews (pilot_id, second_pilot_id)
VALUES
  (1, 4),
  (2, 1),
  (7, 6);

INSERT INTO flight_crews (pilot_id, chief_steward_id)
VALUES
  (1, 5),
  (2, 8),
  (7, 6);

INSERT INTO flight_crews (pilot_id, second_pilot_id, chief_steward_id)
VALUES
  (1, 6, 5),
  (7, 1, 5),
  (7, 4, 6),
  (1, 7, 6),
  (7, 4, 8);

INSERT INTO passengers (person_id, passport)
VALUES
  (21, 'Hzk83-522'),
  (5, '2354-764824'),
  (1, '8346-124872'),
  (2, '83-245 7146'),
  (14, '51P82Rt1#'),
  (19, 'qwerty123456');

INSERT INTO flights (plane_id, flight_crew_id, departure_airport_id, arrival_airport_id, departure_time, arrival_time)
VALUES
  (2, 3, 1, 5, '2015-10-21 10:20:00+00', '2015-10-21 15:20:00+00'),
  (1, 1, 3, 1, '2015-10-22 23:15:00+00', '2015-10-23 02:00:00+00'),
  (1, 2, 2, 5, '2015-10-23 06:40:00+00', '2015-10-23 09:55:00+00'),
  (3, 6, 6, 3, '2015-10-22 12:45:00+00', '2015-10-22 18:55:00+00'),
  (10, 14, 6, 1, '2015-10-28 22:10:00+00', '2015-10-29 02:55:00+00'),
  (8, 11, 5, 2, '2015-10-26 14:00:00+00', '2015-10-26 17:30:00+00'),
  (5, 7, 3, 1, '2016-02-28 21:50:00+00', '2016-02-29 01:15:00+00'),
  (3, 5, 1, 4, '2016-02-29 23:42:00+00', '2016-03-01 05:36:00+00'),
  (9, 13, 5, 1, '2015-11-11 10:25:00+00', '2016-11-11 12:55:00+00'),
  (1, 8, 2, 5, '2015-11-20 19:46:00+00', '2016-11-20 23:10:00+00');

INSERT INTO flight_passengers (passenger_id, flight_id)
VALUES
  (1, 1),
  (1, 7),
  (1, 3),
  (1, 8),
  (6, 10),
  (6, 4),
  (6, 8),
  (6, 7),
  (6, 9),
  (2, 5),
  (2, 3),
  (2, 4),
  (2, 9),
  (2, 2),
  (3, 10),
  (3, 5),
  (4, 2),
  (4, 4),
  (4, 6),
  (4, 8),
  (4, 10),
  (5, 3),
  (5, 6),
  (5, 9);
