INSERT INTO cinemas (name, seat_count, director_name, opened, seat_first_category, seat_second_category, seat_third_category)
VALUES
  ('Родина', 143, 'Владимир Путин', '1989-07-23', 3, 40, 100),
  ('Сувар', 20, 'Барак Обама', '1999-01-15', 5, 5, 10),
  ('Каро', 25, 'Ангела Меркель', '1994-05-23', 5, 10, 10),
  ('Киномакс', 83, 'Франсуа Олланд', '2013-07-06', 3, 30, 50),
  ('Киномечта', 14, 'Елизавета II', '1990-08-23', 2, 4, 8),
  ('Корстон', 84, 'Дмитрий Медведев', '1970-01-01', 4, 10, 70),
  ('Мир', 210, 'Билл Гейтс', '2015-10-03', 9, 51, 150),
  ('Магия кино', 42, 'Стив Джобс', '1995-08-19', 2, 5, 35),
  ('Октябрь', 77, 'Ларии Пейдж', '2009-12-17', 7, 20, 50),
  ('Арсенал', 99, 'Сергей Лавров', '2000-04-27', 9, 40, 50);

SELECT *
FROM cinemas;

INSERT INTO films (name, origin, costs_per_day, has_festival_prizes, duration)
VALUES
  ('Великий Гетсби', 'foreign', 561, TRUE, 127),
  ('Маленький принц', 'foreign', 182, TRUE, 84),
  ('Поллианна', 'foreign', 24, FALSE, 108),
  ('Волхв', 'foreign', 56, FALSE, 186),
  ('Мастер и Маргарита', 'local', 76, TRUE, 137),
  ('Побег из Шоушенка', 'foreign', 812, TRUE, 142),
  ('Зеленая миля', 'foreign', 231, FALSE, 189),
  ('Форрест Гамп', 'foreign', 321, TRUE, 142),
  ('Начало', 'foreign', 23, FALSE, 148),
  ('Иван Васильевич меняет профессию', 'local', 72, FALSE, 88);

SELECT *
FROM films;

INSERT INTO distributions (cinema_id, film_id, started, finished, seat_first_category_price, seat_second_category_price, seat_third_category_price, fee)
VALUES
  (1, 5, '1994-05-23', '1994-07-06', 500, 200, 100, 1856946),
  (1, 8, '2000-01-23', '2000-07-06', 600, 300, 200, 67185),
  (1, 6, '2000-04-19', '2000-10-14', 200, 150, 100, 5614),
  (3, 6, '2000-10-12', '2000-12-12', 100, 70, 50, 894),
  (5, 2, '1995-10-12', '1996-12-12', 800, 500, 300, 9845685),
  (7, 9, '2000-03-12', '2000-05-12', 700, 600, 500, 764454),
  (2, 1, '2010-10-10', '2011-11-11', 300, 200, 100, 49851656),
  (9, 1, '2015-10-01', '2015-10-03', 900, 700, 500, 21),
  (3, 7, '2000-05-25', '2015-06-30', 400, 250, 180, 451),
  (3, 10, '1999-12-31', '2001-01-01', 561, 432, 142, 9456554);

SELECT *
FROM distributions;
